[
  {
    "bookId": 1,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.postimg.cc/rpdqCMHv/img.png",
    "review": "To Kill a Mockingbird is a timeless classic that explores themes of racial injustice, morality, and compassion in the Deep South of the 1930s. Harper Lee's masterful storytelling and rich characterization bring to life the small town of Maycomb and its inhabitants, offering readers a poignant reflection on the complexities of human nature and the power of empathy.",
    "totalPages": 336,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Social Justice", "Southern Literature"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 2,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.postimg.cc/zvb6bGPf/book-Three.png",
    "review": "The Great Gatsby is a mesmerizing tale of love, ambition, and the pursuit of the American Dream set against the backdrop of the Roaring Twenties. F. Scott Fitzgerald's lyrical prose and vivid imagery transport readers to the glittering world of East and West Egg, where the enigmatic Jay Gatsby pursues his elusive dream of reuniting with his lost love, Daisy Buchanan. ",
    "totalPages": 180,
    "rating": 4.2,
    "category": "Fiction",
    "tags": ["Romance", "American Literature"],
    "publisher": "Scribner",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 3,
    "bookName": "Nineteen Eighty-Four",
    "author": "George Orwell",
    "image": "https://i.postimg.cc/tgkL8fx9/bookTwo.png",
    "review": "1984 is a dystopian masterpiece that explores themes of totalitarianism, surveillance, and the erosion of individual freedom in a bleak future society. George Orwell's chilling vision of a totalitarian regime has captivated readers for decades, serving as a cautionary tale about the dangers of unchecked power and government control. With its vivid imagery and thought-provoking narrative, 1984 continues to resonate with readers around the world, reminding us of the importance of preserving our liberties and safeguarding against authoritarianism.",
    "totalPages": 328,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Dystopian", "Science Fiction"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 4,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.postimg.cc/pT13LFC7/bookOne.png",
    "review": "The Catcher in the Rye is a coming-of-age novel that captures the disillusionment and alienation of adolescence with raw honesty and wit. J.D. Salinger's iconic protagonist, Holden Caulfield, has become an enduring symbol of teenage angst and rebellion, resonating with readers of all generations. Through Holden's candid narration and sardonic wit, Salinger offers a poignant exploration of identity, alienation, and the search for authenticity in a world that often feels phony and superficial. With its timeless themes and memorable characters, The Catcher in the Rye continues to captivate readers and inspire generations of writers.",
    "totalPages": 224,
    "rating": 4.0,
    "category": "Fiction",
    "tags": ["Coming-of-Age", "Existentialism"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 5,
    "bookName": "Brave New World",
    "author": "Aldous Huxley",
    "image": "https://i.postimg.cc/cH2n6Gz3/book-Eight.jpg",
    "review": "Huxley's dystopian vision of a future society is both disturbing and thought-provoking. In 'Brave New World', Aldous Huxley presents a chilling depiction of a technologically advanced world where humanity is enslaved by pleasure and conformity. Set in a dystopian future where individuality is suppressed and happiness is manufactured, the novel explores themes of genetic engineering, social conditioning, and the dehumanizing effects of technology. Through the lens of characters like Bernard Marx and John the Savage, Huxley critiques the dangers of a society driven by consumerism and instant gratification, urging readers to question the price of progress and the meaning of human existence.",
    "totalPages": 288,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Dystopian", "Science"],
    "publisher": "Chatto & Windus",
    "yearOfPublishing": 1932
  },
  {
    "bookId": 6,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://i.postimg.cc/qBNvXcPN/bookFive.png",
    "review": "The Hobbit is a charming adventure story set in Middle-earth, following the journey of Bilbo Baggins as he embarks on a quest to reclaim treasure guarded by a dragon. J.R.R. Tolkien's enchanting narrative and rich world-building transport readers to a fantastical realm filled with elves, dwarves, wizards, and dragons. Through Bilbo's adventures and encounters with various creatures, Tolkien explores themes of courage, friendship, and the power of home. With its captivating storytelling and timeless appeal, The Hobbit continues to enchant readers of all ages, inspiring countless adaptations and earning its place as a beloved classic of fantasy literature.",
    "totalPages": 310,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": ["Adventure", "High Fantasy"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1937
  },
  {
    "bookId": 7,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.postimg.cc/PJgcmnBQ/bookFour.png",
    "review": "Pride and Prejudice is a delightful romantic comedy of manners that explores themes of love, marriage, and social class in Georgian England. Jane Austen's witty dialogue, memorable characters, and keen observations of society make this novel a timeless classic that continues to charm readers of all ages. Through the spirited courtship of Elizabeth Bennet and Mr. Darcy, Austen navigates the complexities of human relationships and challenges societal norms with humor and insight.",
    "totalPages": 432,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Romance", "Regency Era"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "bookId": 8,
    "bookName": "The Lord of the Rings",
    "author": "J.R.R. Tolkien",
    "image": "https://i.postimg.cc/pV5j4y9J/book-Eleven.jpg",
    "review": "Tolkien's magnum opus is an unparalleled work of fantasy, rich in detail and imagination. 'The Lord of the Rings' transports readers to the enchanting world of Middle-earth, where epic battles, ancient lore, and unforgettable characters converge in a timeless tale of heroism and sacrifice. As Frodo Baggins embarks on his perilous quest to destroy the One Ring and thwart the dark lord Sauron, Tolkien weaves together themes of friendship, courage, and the enduring power of hope. With its immersive world-building and intricate mythology, 'The Lord of the Rings' has captivated generations of readers, solidifying its status as a literary masterpiece.",
    "totalPages": 1178,
    "rating": 4.9,
    "category": "Fiction",
    "tags": ["Fantasy", "Adventure"],
    "publisher": "Allen & Unwin",
    "yearOfPublishing": 1954
  },
  {
    "bookId": 9,
    "bookName": "To the Lighthouse",
    "author": "Virginia Woolf",
    "image": "https://i.postimg.cc/vTn6VSRN/bookNine.jpg",
    "review": "Woolf's stream-of-consciousness narrative offers a profound exploration of human experience. 'To the Lighthouse' is a lyrical and introspective novel that delves into the complexities of memory, perception, and the passage of time. Set against the backdrop of a family vacation on the Isle of Skye, Woolf intricately weaves together the perspectives of various characters, capturing their innermost thoughts and emotions with remarkable depth and sensitivity. Through its innovative narrative style and evocative prose, 'To the Lighthouse' invites readers to contemplate the nature of reality and the interconnectedness of past, present, and future.",
    "totalPages": 209,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Modernist", "Literary"],
    "publisher": "Hogarth Press",
    "yearOfPublishing": 1927
  },
  {
    "bookId": 10,
    "bookName": "The Hitchhiker's Guide to the Galaxy",
    "author": "Douglas Adams",
    "image": "https://i.postimg.cc/7ZwT5VKK/book-Seven.jpg",
    "review": "Adams' irreverent and hilarious take on space travel is a must-read for science fiction fans. 'The Hitchhiker's Guide to the Galaxy' is a satirical romp through the cosmos, following the misadventures of Arthur Dent, an ordinary human who finds himself thrust into an intergalactic journey after the Earth is unexpectedly demolished to make way for a hyperspace bypass. With its witty humor, absurd scenarios, and memorable characters like Ford Prefect and Zaphod Beeblebrox, Adams' cult classic offers a fresh and humorous perspective on the absurdity of life, the universe, and everything in between.",
    "totalPages": 193,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Science Fiction", "Humor"],
    "publisher": "Pan Books",
    "yearOfPublishing": 1979
  },
  {
    "bookId": 11,
    "bookName": "Crime and Punishment",
    "author": "Fyodor Dostoevsky",
    "image": "https://i.postimg.cc/DyVGTFLk/bookTen.jpg",
    "review": "A psychological masterpiece that delves into the depths of guilt and redemption. 'Crime and Punishment' follows the tormented Raskolnikov as he grapples with the moral consequences of his actions after committing a heinous crime. Dostoevsky's penetrating exploration of guilt, conscience, and the human condition is as relevant today as it was upon its publication. Through its complex characters and philosophical themes, the novel offers profound insights into the nature of justice, suffering, and the search for redemption.",
    "totalPages": 551,
    "rating": 4.8,
    "category": "Fiction",
    "tags": ["Psychological", "Classic"],
    "publisher": "The Russian Messenger",
    "yearOfPublishing": 1866
  },
  {
    "bookId": 12,
    "bookName": "Frankenstein",
    "author": "Mary Shelley",
    "image": "https://i.postimg.cc/3Jgvr6Fy/book-Tweleve.jpg",
    "review": "Shelley's groundbreaking novel explores the consequences of unchecked scientific ambition. 'Frankenstein' tells the story of Victor Frankenstein, a young scientist who creates a sentient being through an unorthodox experiment. As the consequences of his actions unfold, Victor is forced to confront his own hubris and the moral implications of playing god. Through its Gothic atmosphere and themes of alienation, responsibility, and the pursuit of knowledge, Shelley's timeless tale remains a cautionary warning against the dangers of unchecked ambition and the ethical responsibilities of scientific discovery.",
    "totalPages": 280,
    "rating": 4.4,
    "category": "Fiction",
    "tags": ["Gothic", "Science Fiction"],
    "publisher": "Lackington, Hughes, Harding, Mavor & Jones",
    "yearOfPublishing": 1818
  },
  {
    "bookId": 13,
    "bookName": "The Picture of Dorian Gray",
    "author": "Oscar Wilde",
    "image": "https://i.postimg.cc/DZwvwpT1/book-Therteen.jpg",
    "review": "Wilde's haunting tale of vanity and corruption remains as captivating as ever. 'The Picture of Dorian Gray' follows the young and handsome Dorian as he makes a Faustian bargain to preserve his youthful appearance while his portrait ages in his stead. As Dorian descends into a life of hedonism and moral decay, Wilde explores themes of beauty, morality, and the nature of art. With its rich prose and provocative insights, 'The Picture of Dorian Gray' continues to provoke thought and inspire debate.",
    "totalPages": 254,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Gothic", "Philosophical"],
    "publisher": "Ward, Lock & Co.",
    "yearOfPublishing": 1890
  },
  {
    "bookId": 14,
    "bookName": "One Hundred Years of Solitude",
    "author": "Gabriel García Márquez",
    "image": "https://i.postimg.cc/V6ZYr9fp/book-Fourteen.jpg",
    "review": "Márquez's masterpiece weaves a tapestry of magical realism and familial saga. 'One Hundred Years of Solitude' chronicles the multi-generational Buendía family and their mythical town of Macondo. Through a blend of magical realism and historical allegory, Márquez explores themes of love, memory, and the cyclical nature of history. With its lush prose and vivid imagery, the novel transports readers to a world where the extraordinary and the mundane coexist, leaving an indelible mark on the literary landscape.",
    "totalPages": 417,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Magical Realism", "Family Saga"],
    "publisher": "Harper & Row",
    "yearOfPublishing": 1967
  },
  {
    "bookId": 15,
    "bookName": "The Brothers Karamazov",
    "author": "Fyodor Dostoevsky",
    "image": "https://i.postimg.cc/GhWmxjF1/book-Fiften.jpg",
    "review": "Dostoevsky's exploration of faith, morality, and family dynamics is both profound and gripping. 'The Brothers Karamazov' is a sprawling epic that follows the tumultuous lives of the Karamazov family as they grapple with questions of religion, ethics, and the existence of God. Through its complex characters and philosophical dialogues, Dostoevsky delves into the depths of the human soul, exposing the inner conflicts and contradictions that define the human condition. With its blend of psychological depth and narrative intensity, 'The Brothers Karamazov' remains a towering achievement in world literature.",
    "totalPages": 796,
    "rating": 4.8,
    "category": "Fiction",
    "tags": ["Philosophical", "Classic"],
    "publisher": "The Russian Messenger",
    "yearOfPublishing": 1880
  },
  {
    "bookId": 16,
    "bookName": "The Road",
    "author": "Cormac McCarthy",
    "image": "https://i.postimg.cc/mrwZRf0b/book-Sixteen.jpg",
    "review": "McCarthy's stark and haunting prose paints a bleak yet mesmerizing portrait of a post-apocalyptic world. 'The Road' follows a father and son as they journey across a desolate landscape ravaged by an unspecified catastrophe. As they struggle to survive in a world devoid of hope and humanity, McCarthy explores themes of love, resilience, and the bonds that unite us in the face of adversity. With its spare yet evocative language, 'The Road' is a powerful meditation on the enduring power of hope and the resilience of the human spirit.",
    "totalPages": 241,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Dystopian", "Survival"],
    "publisher": "Alfred A. Knopf",
    "yearOfPublishing": 2006
  },
  {
    "bookId": 17,
    "bookName": "The Bell Jar",
    "author": "Sylvia Plath",
    "image": "https://i.postimg.cc/NjRfJrD2/book-Seventeen.jpg",
    "review": "Plath's semi-autobiographical novel offers a haunting depiction of mental illness and societal pressures. 'The Bell Jar' follows Esther Greenwood, a talented young woman who descends into a downward spiral of depression and disillusionment. Set against the backdrop of 1950s America, Plath's searing prose captures the suffocating constraints of gender roles and the stigma surrounding mental health. Through Esther's journey of self-discovery and despair, 'The Bell Jar' offers a raw and unflinching portrayal of the human psyche and the quest for identity in a world that demands conformity.",
    "totalPages": 288,
    "rating": 4.4,
    "category": "Fiction",
    "tags": ["Autobiographical", "Mental Health"],
    "publisher": "Heinemann",
    "yearOfPublishing": 1963
  },
  {
    "bookId": 18,
    "bookName": "The Count of Monte Cristo",
    "author": "Alexandre Dumas",
    "image": "https://i.postimg.cc/3w7rPJfS/book-Eightteen.jpg",
    "review": "Dumas' swashbuckling adventure of revenge and redemption is a timeless classic. 'The Count of Monte Cristo' follows the story of Edmond Dantès, a young sailor who is wrongfully imprisoned and seeks vengeance against those who betrayed him. Set against the backdrop of Napoleonic France, Dumas' epic tale is a thrilling adventure filled with intrigue, romance, and suspense. Through Dantès' quest for justice and redemption, the novel explores themes of betrayal, forgiveness, and the nature of true happiness. With its unforgettable characters and riveting plot, 'The Count of Monte Cristo' continues to captivate readers of all ages.",
    "totalPages": 1276,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Adventure", "Classic"],
    "publisher": "Pétion",
    "yearOfPublishing": 1844
  },
  {
    "bookId": 19,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.postimg.cc/vTpbXQ6v/book-Nineteen.png",
    "review": "Salinger's poignant portrayal of teenage angst and rebellion remains a classic. 'The Catcher in the Rye' follows the disillusioned Holden Caulfield as he navigates the complexities of adolescence and societal expectations in post-World War II America. Through Holden's distinctive voice and introspective musings, Salinger captures the alienation and vulnerability of youth, while also addressing themes of identity, authenticity, and the loss of innocence. Despite being published over half a century ago, the novel's candid exploration of the human condition continues to resonate with readers of all ages, solidifying its status as a timeless coming-of-age tale.",
    "totalPages": 224,
    "rating": 4.4,
    "category": "Fiction",
    "tags": ["Coming of Age", "Literary"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 20,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://i.postimg.cc/kGV7xVD4/book-Twenty.png",
    "review": "Tolkien's enchanting tale of adventure and heroism is a beloved classic of children's literature. 'The Hobbit' follows the journey of Bilbo Baggins, a hobbit who is swept into an epic quest to reclaim the lost kingdom of Erebor from the fearsome dragon Smaug. Along the way, Bilbo encounters trolls, elves, goblins, and a mysterious creature named Gollum, testing his courage and resourcefulness at every turn. With its whimsical charm, rich world-building, and timeless themes of friendship and bravery, 'The Hobbit' continues to capture the imaginations of readers of all ages.",
    "totalPages": 310,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Fantasy", "Adventure"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1937
  },
  {
    "bookId": 21,
    "bookName": "Harry Potter and the Philosopher's Stone",
    "author": "J.K. Rowling",
    "image": "https://i.postimg.cc/9fY7dWrK/book-Twenty-One.png",
    "review": "Rowling's magical debut captivates readers with its whimsical charm and richly imagined world. 'Harry Potter and the Philosopher's Stone' introduces readers to the young wizard Harry Potter as he embarks on his journey at Hogwarts School of Witchcraft and Wizardry. With its endearing characters, thrilling adventures, and underlying themes of friendship, courage, and the power of love, Rowling's inaugural novel lays the foundation for one of the most beloved literary series of all time.",
    "totalPages": 223,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": ["Magic", "Young Adult"],
    "publisher": "Bloomsbury",
    "yearOfPublishing": 1997
  },
  {
    "bookId": 22,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://i.postimg.cc/QMQpfQn6/book-Twenty-Two.png",
    "review": "Coelho's philosophical fable inspires readers with its timeless wisdom and spiritual journey. 'The Alchemist' follows Santiago, a shepherd boy who embarks on a quest to find a hidden treasure and fulfill his personal legend. Along the way, Santiago encounters a series of challenges and learns profound lessons about following one's dreams, listening to one's heart, and embracing the journey of self-discovery. With its lyrical prose and universal themes of destiny and purpose, 'The Alchemist' has touched the hearts of millions worldwide, making it a modern classic of inspirational literature.",
    "totalPages": 197,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Philosophical", "Spiritual"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1988
  },
  {
    "bookId": 23,
    "bookName": "The Hunger Games",
    "author": "Suzanne Collins",
    "image": "https://i.postimg.cc/tCsWKQMn/book-Twenty-Three.png",
    "review": "Collins' gripping dystopian tale enthralls readers with its adrenaline-fueled action and thought-provoking themes. 'The Hunger Games' takes place in a future world where society is divided into districts and children are forced to participate in a televised fight to the death known as the Hunger Games. Through the eyes of Katniss Everdeen, Collins explores themes of survival, sacrifice, and the consequences of unchecked power. With its compelling narrative and strong female protagonist, 'The Hunger Games' has become a cultural phenomenon, sparking discussions about politics, media, and the ethics of entertainment.",
    "totalPages": 374,
    "rating": 4.5,
    "category": "Science Fiction",
    "tags": ["Dystopian", "Young Adult"],
    "publisher": "Scholastic Corporation",
    "yearOfPublishing": 2008
  },
  {
    "bookId": 24,
    "bookName": "The Road Less Traveled",
    "author": "M. Scott Peck",
    "image": "https://i.postimg.cc/J0nZ797g/book-Twenty-Four.png",
    "review": "Peck's seminal work offers timeless insights into the journey of personal growth and spiritual development. 'The Road Less Traveled' combines psychology, philosophy, and spirituality to explore the path to a fulfilled life. Through a series of anecdotes, case studies, and practical advice, Peck encourages readers to confront life's challenges with courage, discipline, and love. With its profound wisdom and compassionate guidance, 'The Road Less Traveled' has empowered millions to embark on a journey of self-discovery and transformation.",
    "totalPages": 315,
    "rating": 4.6,
    "category": "Nonfiction",
    "tags": ["Self-Help", "Psychology"],
    "publisher": "Simon & Schuster",
    "yearOfPublishing": 1978
  },
  {
    "bookId": 25,
    "bookName": "The Power of Now",
    "author": "Eckhart Tolle",
    "image": "https://i.postimg.cc/X7Nn2dQs/book-Twenty-Two-Five.png",
    "review": "Tolle's groundbreaking book offers a profound guide to spiritual enlightenment and living in the present moment. 'The Power of Now' teaches readers how to free themselves from the grip of their ego and awaken to their true essence. Through simple yet profound teachings, Tolle invites readers to transcend their identification with the mind and connect with the eternal presence of consciousness. With its transformative insights and practical exercises, 'The Power of Now' has become a spiritual classic, empowering readers to experience inner peace and fulfillment.",
    "totalPages": 236,
    "rating": 4.7,
    "category": "Nonfiction",
    "tags": ["Spirituality", "Self-Help"],
    "publisher": "New World Library",
    "yearOfPublishing": 1997
  },
  {
    "bookId": 26,
    "bookName": "Man's Search for Meaning",
    "author": "Viktor E. Frankl",
    "image": "https://i.postimg.cc/XNRwdNLN/book-Twenty-Six.png",
    "review": "Frankl's profound memoir offers a powerful testament to the resilience of the human spirit in the face of suffering. 'Man's Search for Meaning' chronicles Frankl's experiences as a prisoner in Nazi concentration camps during World War II, where he witnessed unimaginable horrors and yet found meaning and purpose in the midst of despair. Through his existential analysis and theory of logotherapy, Frankl explores the fundamental question of human existence and the importance of finding meaning in life, even in the most difficult circumstances. With its profound insights and poignant reflections, 'Man's Search for Meaning' continues to inspire readers to find hope and meaning in the darkest of times.",
    "totalPages": 165,
    "rating": 4.8,
    "category": "Nonfiction",
    "tags": ["Memoir", "Psychology"],
    "publisher": "Beacon Press",
    "yearOfPublishing": 1946
  },
  {
    "bookId": 27,
    "bookName": "Thinking, Fast and Slow",
    "author": "Daniel Kahneman",
    "image": "https://i.postimg.cc/FzNhXLms/book-Twenty-Seven.png",
    "review": "Kahneman's groundbreaking work revolutionizes our understanding of human decision-making and cognition. 'Thinking, Fast and Slow' explores the two systems that drive the way we think: the fast, intuitive, and emotional System 1, and the slow, deliberate, and logical System 2. Through a series of experiments and anecdotes, Kahneman sheds light on the biases and heuristics that influence our judgments and choices. With its insights into the quirks of the human mind, 'Thinking, Fast and Slow' offers valuable lessons for anyone seeking to understand the complexities of decision-making and behavior.",
    "totalPages": 499,
    "rating": 4.7,
    "category": "Nonfiction",
    "tags": ["Psychology", "Behavioral Economics"],
    "publisher": "Farrar, Straus and Giroux",
    "yearOfPublishing": 2011
  },
  {
    "bookId": 28,
    "bookName": "Sapiens: A Brief History of Humankind",
    "author": "Yuval Noah Harari",
    "image": "https://i.postimg.cc/Bv9T5YNL/book-Twenty-Eight.jpg",
    "review": "Harari's sweeping narrative offers a captivating journey through the history of humanity, from our earliest ancestors to the present day. 'Sapiens: A Brief History of Humankind' explores the key events and developments that have shaped the course of human evolution, from the cognitive revolution to the agricultural revolution to the rise of empires and civilizations. With its engaging storytelling and thought-provoking insights, Harari challenges readers to reconsider their understanding of history, society, and the human experience.",
    "totalPages": 443,
    "rating": 4.8,
    "category": "Nonfiction",
    "tags": ["History", "Anthropology"],
    "publisher": "Harper",
    "yearOfPublishing": 2014
  },
  {
    "bookId": 29,
    "bookName": "Educated",
    "author": "Tara Westover",
    "image": "https://i.postimg.cc/fT1mZ2G2/book-Twenty-Nine.jpg",
    "review": "Westover's gripping memoir is a testament to the power of education and self-discovery. 'Educated' chronicles Westover's remarkable journey from growing up in a strict and isolated family in rural Idaho to earning a PhD from Cambridge University. Along the way, she grapples with the challenges of self-invention, confronting her own beliefs and forging her own path against all odds. Through her resilience and determination, Westover sheds light on the transformative power of knowledge and the pursuit of truth.",
    "totalPages": 334,
    "rating": 4.7,
    "category": "Nonfiction",
    "tags": ["Memoir", "Education"],
    "publisher": "Random House",
    "yearOfPublishing": 2018
  },
  {
    "bookId": 30,
    "bookName": "The Silent Patient",
    "author": "Alex Michaelides",
    "image": "https://i.postimg.cc/DZwvwpT1/book-Therteen.jpg",
    "review": "Michaelides' gripping psychological thriller keeps readers on the edge of their seats until the very end. 'The Silent Patient' follows Alicia Berenson, a celebrated painter who murders her husband and then stops speaking altogether. When psychotherapist Theo Faber takes on her case, he becomes determined to unravel the mystery behind her silence and uncover the truth. With its twisty plot and unreliable narrator, 'The Silent Patient' is a riveting exploration of guilt, trauma, and the complexity of the human mind.",
    "totalPages": 323,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Thriller", "Psychological"],
    "publisher": "Celadon Books",
    "yearOfPublishing": 2019
  }
]
