[
  {
    "bookId": 1,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.postimg.cc/rpdqCMHv/img.png",
    "review": "To Kill a Mockingbird is a timeless classic that explores themes of racial injustice, morality, and compassion in the Deep South of the 1930s. Harper Lee's masterful storytelling and rich characterization bring to life the small town of Maycomb and its inhabitants, offering readers a poignant reflection on the complexities of human nature and the power of empathy.",
    "totalPages": 336,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Social Justice", "Southern Literature"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 2,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.postimg.cc/zvb6bGPf/book-Three.png",
    "review": "The Great Gatsby is a mesmerizing tale of love, ambition, and the pursuit of the American Dream set against the backdrop of the Roaring Twenties. F. Scott Fitzgerald's lyrical prose and vivid imagery transport readers to the glittering world of East and West Egg, where the enigmatic Jay Gatsby pursues his elusive dream of reuniting with his lost love, Daisy Buchanan. ",
    "totalPages": 180,
    "rating": 4.2,
    "category": "Fiction",
    "tags": ["Romance", "American Literature"],
    "publisher": "Scribner",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 3,
    "bookName": "Nineteen Eighty-Four",
    "author": "George Orwell",
    "image": "https://i.postimg.cc/tgkL8fx9/bookTwo.png",
    "review": "1984 is a dystopian masterpiece that explores themes of totalitarianism, surveillance, and the erosion of individual freedom in a bleak future society. George Orwell's chilling vision of a totalitarian regime has captivated readers for decades, serving as a cautionary tale about the dangers of unchecked power and government control. With its vivid imagery and thought-provoking narrative, 1984 continues to resonate with readers around the world, reminding us of the importance of preserving our liberties and safeguarding against authoritarianism.",
    "totalPages": 328,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Dystopian", "Science Fiction"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 4,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.postimg.cc/pT13LFC7/bookOne.png",
    "review": "The Catcher in the Rye is a coming-of-age novel that captures the disillusionment and alienation of adolescence with raw honesty and wit. J.D. Salinger's iconic protagonist, Holden Caulfield, has become an enduring symbol of teenage angst and rebellion, resonating with readers of all generations. Through Holden's candid narration and sardonic wit, Salinger offers a poignant exploration of identity, alienation, and the search for authenticity in a world that often feels phony and superficial. With its timeless themes and memorable characters, The Catcher in the Rye continues to captivate readers and inspire generations of writers.",
    "totalPages": 224,
    "rating": 4.0,
    "category": "Fiction",
    "tags": ["Coming-of-Age", "Existentialism"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 5,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.postimg.cc/PJgcmnBQ/bookFour.png",
    "review": "Pride and Prejudice is a delightful romantic comedy of manners that explores themes of love, marriage, and social class in Georgian England. Jane Austen's witty dialogue, memorable characters, and keen observations of society make this novel a timeless classic that continues to charm readers of all ages. Through the spirited courtship of Elizabeth Bennet and Mr. Darcy, Austen navigates the complexities of human relationships and challenges societal norms with humor and insight.",
    "totalPages": 432,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Romance", "Regency Era"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "bookId": 6,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://i.postimg.cc/qBNvXcPN/bookFive.png",
    "review": "The Hobbit is a charming adventure story set in Middle-earth, following the journey of Bilbo Baggins as he embarks on a quest to reclaim treasure guarded by a dragon. J.R.R. Tolkien's enchanting narrative and rich world-building transport readers to a fantastical realm filled with elves, dwarves, wizards, and dragons. Through Bilbo's adventures and encounters with various creatures, Tolkien explores themes of courage, friendship, and the power of home. With its captivating storytelling and timeless appeal, The Hobbit continues to enchant readers of all ages, inspiring countless adaptations and earning its place as a beloved classic of fantasy literature.",
    "totalPages": 310,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": ["Adventure", "High Fantasy"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1937
  }
]
